<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'وصف کو قبول کرنا چاہیے۔.',
    'active_url' => ': وصف درست URL نہیں ہے۔.',
    'after' => 'وصف: تاریخ کے بعد کی تاریخ ہونی چاہیے۔.',
    'after_or_equal' => ': وصف تاریخ کے بعد یا اس کے برابر ہونا چاہیے۔.',
    'alpha' => 'وصف میں صرف حروف ہونے چاہئیں۔.',
    'alpha_dash' => ': وصف میں صرف حروف ، اعداد ، ڈیشز اور انڈر سکور ہونا ضروری ہے۔.',
    'alpha_num' => ': وصف میں صرف حروف اور اعداد شامل ہونے چاہئیں۔.',
    'array' => ': وصف ایک صف ہونا چاہیے۔.',
    'before' => ': وصف سے پہلے کی تاریخ ہونی چاہیے: تاریخ۔.',
    'before_or_equal' => ': وصف تاریخ سے پہلے یا اس کے برابر ہونا چاہیے۔.',
    'between' => [
        'numeric' => 'وصف: min اور: max کے درمیان ہونا چاہیے۔.',
        'file' => 'وصف: min اور: max kilobytes کے درمیان ہونا چاہیے۔.',
        'string' => 'وصف: min اور: max حروف کے درمیان ہونا چاہیے۔.',
        'array' => ': وصف کے درمیان ہونا چاہیے: min اور: max items.',
    ],
    'boolean' => ': وصف کا میدان درست یا غلط ہونا چاہیے۔.',
    'confirmed' => ': وصف کی تصدیق مماثل نہیں ہے۔.',
    'date' => 'وصف ایک درست تاریخ نہیں ہے۔.',
    'date_equals' => ': وصف ایک تاریخ کے برابر ہونا چاہیے: تاریخ۔.',
    'date_format' => ': وصف فارمیٹ: فارمیٹ سے مماثل نہیں ہے۔.',
    'different' => ': وصف اور: دیگر مختلف ہونا ضروری ہے۔.',
    'digits' => ': وصف ہونا ضروری ہے: ہندسے ہندسے۔.',
    'digits_between' => 'وصف: min اور: max ہندسوں کے درمیان ہونا چاہیے۔.',
    'dimensions' => ': وصف میں تصویر کے غلط طول و عرض ہیں۔.',
    'distinct' => ': وصف فیلڈ میں ایک ڈپلیکیٹ ویلیو ہے۔.',
    'email' => ': وصف ایک درست ای میل پتہ ہونا چاہیے۔.',
    'ends_with' => ': وصف کو درج ذیل میں سے ایک کے ساتھ ختم ہونا چاہیے: اقدار۔.',
    'exists' => 'منتخب: وصف غلط ہے۔.',
    'file' => ': وصف ایک فائل ہونا چاہیے۔.',
    'filled' => ': انتساب فیلڈ کی ایک قدر ہونی چاہیے۔.',
    'gt' => [
        'numeric' => ': وصف قدر سے زیادہ ہونا چاہیے۔.',
        'file' => 'وصف: قدر کلو بائٹس سے بڑا ہونا چاہیے۔.',
        'string' => 'وصف: قدر حروف سے بڑا ہونا چاہیے۔.',
        'array' => ': وصف میں قدر سے زیادہ اشیاء ہونی چاہئیں۔.',
    ],
    'gte' => [
        'numeric' => ': وصف زیادہ یا برابر ہونا چاہیے: قدر۔.',
        'file' => ': وصف زیادہ یا برابر ہونا چاہیے: ویلیو کلو بائٹس۔.',
        'string' => ': وصف زیادہ یا برابر ہونا چاہیے: قدر حروف۔.',
        'array' => ': وصف میں ہونا چاہیے: قدر اشیاء یا زیادہ۔.',
    ],
    'image' => 'وصف ایک تصویر ہونا چاہیے۔.',
    'in' => 'منتخب: وصف غلط ہے۔.',
    'in_array' => ': وصف فیلڈ: دیگر میں موجود نہیں ہے۔.',
    'integer' => ': وصف ایک عدد ہونا چاہیے۔.',
    'ip' => ': وصف ایک درست IP پتہ ہونا چاہیے۔.',
    'ipv4' => ': وصف ایک درست IPv4 پتہ ہونا چاہیے۔.',
    'ipv6' => ': وصف ایک درست IPv6 پتہ ہونا چاہیے۔.',
    'json' => ': وصف ایک درست JSON تار ہونا چاہیے۔.',
    'lt' => [
        'numeric' => 'وصف: قدر سے کم ہونا چاہیے۔.',
        'file' => 'وصف: ویلیو کلو بائٹس سے کم ہونا چاہیے۔.',
        'string' => 'وصف: قدر حروف سے کم ہونا چاہیے۔.',
        'array' => 'وصف میں قدر سے کم اشیاء ہونی چاہئیں۔.',
    ],
    'lte' => [
        'numeric' => ': وصف کم یا برابر ہونا چاہیے: قدر۔.',
        'file' => ': وصف کم یا برابر ہونا چاہیے: ویلیو کلو بائٹس۔.',
        'string' => ': وصف کم یا برابر ہونا چاہیے: قدر حروف۔.',
        'array' => ': وصف میں قدر سے زیادہ اشیاء نہیں ہونی چاہئیں۔.',
    ],
    'max' => [
        'numeric' => ': وصف زیادہ سے زیادہ نہیں ہونا چاہیے۔.',
        'file' => ': وصف زیادہ سے زیادہ نہیں ہونا چاہیے: زیادہ سے زیادہ کلو بائٹس۔.',
        'string' => ': وصف زیادہ سے زیادہ حروف سے بڑا نہیں ہونا چاہیے۔.',
        'array' => ': وصف میں زیادہ سے زیادہ اشیاء نہیں ہونی چاہئیں۔.',
    ],
    'mimes' => ': وصف قسم:: اقدار کی فائل ہونی چاہیے۔.',
    'mimetypes' => ': وصف قسم:: اقدار کی فائل ہونی چاہیے۔.',
    'min' => [
        'numeric' => 'وصف کم از کم: من ہونا چاہیے۔.',
        'file' => 'وصف کم از کم: کم از کم کلو بائٹس ہونا چاہیے۔.',
        'string' => ': وصف کم از کم: کم از کم حروف کا ہونا چاہیے۔.',
        'array' => ': وصف میں کم از کم: کم سے کم اشیاء ہونی چاہئیں۔.',
    ],
    'multiple_of' => ': وصف کا ایک سے زیادہ ہونا ضروری ہے: قدر۔.',
    'not_in' => 'منتخب: وصف غلط ہے۔.',
    'not_regex' => ': وصف کی شکل غلط ہے۔.',
    'numeric' => 'وصف ایک عدد ہونا چاہیے۔.',
    'password' => 'پاس ورڈ غلط ہے۔.',
    'present' => ': وصف کا فیلڈ موجود ہونا چاہیے۔.',
    'regex' => ': وصف کی شکل غلط ہے۔.',
    'required' => ': وصف فیلڈ درکار ہے۔.',
    'required_if' => ': وصف فیلڈ کی ضرورت ہوتی ہے جب: دیگر ہے: قدر۔.',
    'required_unless' => ': وصف کا فیلڈ درکار ہے جب تک کہ: دیگر اس میں نہ ہو: اقدار۔.',
    'required_with' => ': وصف فیلڈ کی ضرورت ہوتی ہے جب: اقدار موجود ہوں۔.',
    'required_with_all' => ': وصف فیلڈ کی ضرورت ہوتی ہے جب: اقدار موجود ہوں۔.',
    'required_without' => ': وصف فیلڈ کی ضرورت ہوتی ہے جب: اقدار موجود نہیں ہیں۔.',
    'required_without_all' => ': وصف فیلڈ کی ضرورت ہوتی ہے جب کوئی بھی: اقدار موجود نہ ہوں۔.',
    'prohibited' => ': وصف کا میدان ممنوع ہے۔.',
    'prohibited_if' => ': وصف کا میدان ممنوع ہے جب: دیگر ہے: قدر۔.',
    'prohibited_unless' => ': وصف فیلڈ ممنوع ہے جب تک کہ: دوسرے میں نہیں ہے: اقدار۔.',
    'same' => ': وصف اور: دوسرے کا مماثل ہونا ضروری ہے۔.',
    'size' => [
        'numeric' => 'وصف ہونا چاہیے: size۔.',
        'file' => 'وصف ہونا چاہیے: سائز کلو بائٹس۔.',
        'string' => ': وصف ہونا چاہیے: سائز حروف۔.',
        'array' => ': وصف میں شامل ہونا چاہیے: سائز آئٹمز۔.',
    ],
    'starts_with' => ': وصف کو مندرجہ ذیل میں سے ایک سے شروع ہونا چاہیے: اقدار۔.',
    'string' => ': وصف ایک تار ہونا چاہیے۔.',
    'timezone' => ': وصف ایک درست زون ہونا چاہیے۔.',
    'unique' => 'وصف پہلے ہی لیا جا چکا ہے۔.',
    'uploaded' => ': وصف اپ لوڈ کرنے میں ناکام رہا۔.',
    'url' => ': وصف کی شکل غلط ہے۔.',
    'uuid' => ': وصف ایک درست UUID ہونا چاہیے۔.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'حسب ضرورت پیغام',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
