<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'ویژگی: باید پذیرفته شود.',
    'active_url' => 'ویژگی: نشانی اینترنتی معتبری نیست.',
    'after' => 'ویژگی: باید تاریخ بعد از: date باشد.',
    'after_or_equal' => 'ویژگی: باید تاریخ بعد یا مساوی با: date باشد.',
    'alpha' => 'ویژگی: فقط باید حروف داشته باشد.',
    'alpha_dash' => 'ویژگی: فقط باید شامل حروف ، اعداد ، خط تیره و زیر خط باشد.',
    'alpha_num' => 'ویژگی: فقط باید شامل حروف و اعداد باشد.',
    'array' => 'ویژگی: باید یک آرایه باشد.',
    'before' => 'ویژگی: باید تاریخ قبل از: date باشد.',
    'before_or_equal' => 'ویژگی: باید تاریخ قبل یا مساوی با: date باشد.',
    'between' => [
        'numeric' => 'ویژگی: باید بین: min و: max باشد.',
        'file' => 'ویژگی: باید بین: min و: max kilobytes باشد.',
        'string' => 'ویژگی: باید بین: min و: max نویسه باشد.',
        'array' => 'ویژگی: باید دارای اقلام: min و: max باشد.',
    ],
    'boolean' => 'فیلد: ویژگی باید درست یا غلط باشد.',
    'confirmed' => 'تأیید ویژگی: مطابقت ندارد.',
    'date' => 'ویژگی: تاریخ معتبری نیست.',
    'date_equals' => 'ویژگی: باید یک تاریخ برابر با: date باشد.',
    'date_format' => 'ویژگی: با قالب: format مطابقت ندارد.',
    'different' => 'ویژگی: و دیگر ویژگی ها باید متفاوت باشد.',
    'digits' => 'ویژگی: باید رقم ارقام باشد.',
    'digits_between' => 'ویژگی: باید بین: min و: max ارقام باشد.',
    'dimensions' => 'ویژگی: ابعاد تصویر نامعتبر است.',
    'distinct' => 'فیلد: ویژگی دارای مقدار تکراری است.',
    'email' => 'ویژگی: باید آدرس ایمیل معتبری باشد.',
    'ends_with' => 'ویژگی: باید با یکی از موارد زیر خاتمه یابد:',
    'exists' => 'ویژگی انتخاب شده: معتبر نیست.',
    'file' => 'ویژگی: باید یک فایل باشد.',
    'filled' => 'فیلد: ویژگی باید دارای مقدار باشد.',
    'gt' => [
        'numeric' => 'ویژگی: باید بزرگتر از: value باشد.',
        'file' => 'ویژگی: باید بزرگتر از: مقدار کیلوبایت باشد.',
        'string' => 'ویژگی: باید بزرگتر از: نویسه های مقدار باشد.',
        'array' => 'ویژگی: باید دارای بیش از: آیتم های مقدار باشد.',
    ],
    'gte' => [
        'numeric' => 'ویژگی: باید بزرگتر یا مساوی مقدار باشد.',
        'file' => 'ویژگی: باید بزرگتر یا مساوی باشد: مقدار کیلوبایت.',
        'string' => 'ویژگی: باید بزرگتر یا مساوی از کاراکترهای مقدار باشد.',
        'array' => 'ویژگی: باید دارای: موارد ارزش یا بیشتر باشد.',
    ],
    'image' => 'ویژگی: باید یک تصویر باشد.',
    'in' => 'ویژگی انتخاب شده: معتبر نیست.',
    'in_array' => 'فیلد: ویژگی در: other وجود ندارد.',
    'integer' => 'ویژگی: باید یک عدد صحیح باشد.',
    'ip' => 'ویژگی: باید یک آدرس IP معتبر باشد.',
    'ipv4' => 'ویژگی: باید یک آدرس IPv4 معتبر باشد.',
    'ipv6' => 'ویژگی: باید یک آدرس IPv6 معتبر باشد.',
    'json' => 'ویژگی: باید یک رشته JSON معتبر باشد.',
    'lt' => [
        'numeric' => 'ویژگی: باید کمتر از: value باشد.',
        'file' => 'ویژگی: باید کمتر از: کیلوبایت مقدار باشد.',
        'string' => 'ویژگی: باید کمتر از: نویسه های مقدار باشد.',
        'array' => 'ویژگی: باید دارای مقادیر کمتر از: value باشد.',
    ],
    'lte' => [
        'numeric' => 'ویژگی: باید کمتر یا مساوی از مقدار باشد.',
        'file' => 'ویژگی: باید کمتر یا مساوی باشد: مقدار کیلوبایت.',
        'string' => 'ویژگی: باید کمتر یا مساوی از نویسه های مقدار باشد.',
        'array' => 'ویژگی: نباید بیش از: موارد مقدار داشته باشد.',
    ],
    'max' => [
        'numeric' => 'ویژگی: نباید بزرگتر از: max باشد.',
        'file' => 'ویژگی: نباید بزرگتر از: max kilobytes باشد.',
        'string' => 'ویژگی: نباید بزرگتر از: max نویسه باشد.',
        'array' => 'ویژگی: نباید بیش از: max مورد داشته باشد.',
    ],
    'mimes' => 'ویژگی: باید یک فایل از نوع:: values باشد.',
    'mimetypes' => 'ویژگی: باید یک فایل از نوع:: values باشد.',
    'min' => [
        'numeric' => 'ویژگی: باید حداقل: min باشد.',
        'file' => 'ویژگی: باید حداقل: حداقل کیلوبایت باشد.',
        'string' => 'ویژگی: باید حداقل: حداقل نویسه باشد.',
        'array' => 'ویژگی: باید حداقل: حداقل موارد را داشته باشد.',
    ],
    'multiple_of' => 'ویژگی: باید مضرب ارزش باشد.',
    'not_in' => 'ویژگی انتخاب شده: معتبر نیست.',
    'not_regex' => 'قالب ویژگی: نامعتبر است.',
    'numeric' => 'ویژگی: باید یک عدد باشد.',
    'password' => 'رمز عبور اشتباه است.',
    'present' => 'فیلد: attribute باید وجود داشته باشد.',
    'regex' => 'قالب ویژگی: نامعتبر است.',
    'required' => 'فیلد: ویژگی مورد نیاز است.',
    'required_if' => 'وقتی: other is: value ، فیلد:',
    'required_unless' => 'فیلد: ویژگی مورد نیاز است مگر اینکه: other در: مقادیر باشد.',
    'required_with' => 'فیلد: ویژگی زمانی مورد نیاز است که: مقادیر موجود باشد.',
    'required_with_all' => 'وقتی: مقادیر موجود است ، فیلد:',
    'required_without' => 'فیلد: ویژگی زمانی مورد نیاز است که: مقادیر موجود نباشد.',
    'required_without_all' => 'فیلد: ویژگی زمانی مورد نیاز است که هیچ یک از مقادیر موجود نباشد.',
    'prohibited' => 'فیلد: ویژگی ممنوع است.',
    'prohibited_if' => 'فیلد: ویژگی زمانی ممنوع است که:',
    'prohibited_unless' => 'فیلد: ویژگی ممنوع است مگر اینکه: other در: مقادیر باشد.',
    'same' => 'ویژگی:: و دیگر باید مطابقت داشته باشد.',
    'size' => [
        'numeric' => 'ویژگی: باید: اندازه باشد.',
        'file' => ': ویژگی باید: اندازه کیلوبایت باشد.',
        'string' => 'ویژگی: باید کاراکترهای: size باشد.',
        'array' => 'ویژگی: باید دارای موارد زیر باشد:',
    ],
    'starts_with' => 'ویژگی: باید با یکی از موارد زیر شروع شود:',
    'string' => 'ویژگی: باید یک رشته باشد.',
    'timezone' => 'ویژگی: باید یک منطقه معتبر باشد.',
    'unique' => 'ویژگی: قبلاً گرفته شده است.',
    'uploaded' => 'ویژگی: بارگذاری نشد.',
    'url' => 'قالب ویژگی: نامعتبر است.',
    'uuid' => 'ویژگی: باید یک UUID معتبر باشد.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'پیام سفارشی',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
